# 十分钟入门pandas

In [1]:
#coding:utf8
%matplotlib inline

这个一篇针对pandas新手的简短入门，想要了解更多复杂的内容，参阅[*Cookbook*](http://pandas.pydata.org/pandas-docs/stable/cookbook.html#cookbook)

通常，我们首先要导入以下几个库：

In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

# 创建对象

通过传递一个list来创建**Series**，pandas会默认创建整型索引：

In [2]:
s = pd.Series([1,3,5,np.nan,6,8])
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

通过传递一个numpy array，日期索引以及列标签来创建一个**DataFrame**：

In [3]:
dates = pd.date_range('20130101', periods=6)
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [4]:
df = pd.DataFrame(np.random.randn(6,4), index=dates, columns=list('ABCD'))
df

                   A         B         C         D
2013-01-01 -0.124427  0.057230  0.595329  0.511044
2013-01-02 -0.203842 -1.057279  1.645415  0.717681
2013-01-03  1.419414  0.410206  1.663222  0.070485
2013-01-04  0.462395 -0.232730  0.319583 -0.576445
2013-01-05 -0.198813  0.767778  0.736342  1.266193
2013-01-06 -1.738391  0.049092  1.319079 -0.403803

通过传递一个能够被转换为类似series的dict对象来创建一个**DataFrame**:

In [5]:
df2 = pd.DataFrame({ 'A' : 1.,
                     'B' : pd.Timestamp('20130102'),
                     'C' : pd.Series(1,index=list(range(4)),dtype='float32'),
                     'D' : np.array([3]*4,dtype='int32'),
                     'E' : pd.Categorical(["test","train","test","train"]),
                     'F' : 'foo' })
df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

可以看到各列的数据类型为：

In [6]:
df2.dtypes

A          float64
B    datetime64[s]
C          float32
D            int32
E         category
F           object
dtype: object

# 查看数据

查看frame中头部和尾部的几行：

In [7]:
df.head()

                   A         B         C         D
2013-01-01 -0.124427  0.057230  0.595329  0.511044
2013-01-02 -0.203842 -1.057279  1.645415  0.717681
2013-01-03  1.419414  0.410206  1.663222  0.070485
2013-01-04  0.462395 -0.232730  0.319583 -0.576445
2013-01-05 -0.198813  0.767778  0.736342  1.266193

In [8]:
df.tail(3)

                   A         B         C         D
2013-01-04  0.462395 -0.232730  0.319583 -0.576445
2013-01-05 -0.198813  0.767778  0.736342  1.266193
2013-01-06 -1.738391  0.049092  1.319079 -0.403803

显示索引、列名以及底层的numpy数据

In [9]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [10]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [11]:
df.values

array([[-0.12442696,  0.05723027,  0.5953292 ,  0.51104444],
       [-0.20384161, -1.05727941,  1.64541458,  0.71768066],
       [ 1.41941401,  0.41020605,  1.66322247,  0.0704849 ],
       [ 0.46239476, -0.2327296 ,  0.31958288, -0.57644498],
       [-0.19881349,  0.76777844,  0.73634193,  1.26619308],
       [-1.73839063,  0.04909226,  1.31907924, -0.40380314]])

describe()能对数据做一个快速统计汇总

In [12]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean  -0.063944 -0.000950  1.046495  0.264192
std    1.031753  0.622163  0.572976  0.701570
min   -1.738391 -1.057279  0.319583 -0.576445
25%   -0.202585 -0.162274  0.630582 -0.285231
50%   -0.161620  0.053161  1.027711  0.290765
75%    0.315689  0.321962  1.563831  0.666022
max    1.419414  0.767778  1.663222  1.266193

对数据做转置：

In [13]:
df.T

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A   -0.124427   -0.203842    1.419414    0.462395   -0.198813   -1.738391
B    0.057230   -1.057279    0.410206   -0.232730    0.767778    0.049092
C    0.595329    1.645415    1.663222    0.319583    0.736342    1.319079
D    0.511044    0.717681    0.070485   -0.576445    1.266193   -0.403803

按轴进行排序：

In [14]:
df.sort_index(axis=1, ascending=False)

                   D         C         B         A
2013-01-01  0.511044  0.595329  0.057230 -0.124427
2013-01-02  0.717681  1.645415 -1.057279 -0.203842
2013-01-03  0.070485  1.663222  0.410206  1.419414
2013-01-04 -0.576445  0.319583 -0.232730  0.462395
2013-01-05  1.266193  0.736342  0.767778 -0.198813
2013-01-06 -0.403803  1.319079  0.049092 -1.738391

按值进行排序 :

In [15]:
df.sort_values(by='B')

                   A         B         C         D
2013-01-02 -0.203842 -1.057279  1.645415  0.717681
2013-01-04  0.462395 -0.232730  0.319583 -0.576445
2013-01-06 -1.738391  0.049092  1.319079 -0.403803
2013-01-01 -0.124427  0.057230  0.595329  0.511044
2013-01-03  1.419414  0.410206  1.663222  0.070485
2013-01-05 -0.198813  0.767778  0.736342  1.266193

# 数据选择

注意：虽然标准的Python/Numpy的表达式能完成选择与赋值等功能，但我们仍推荐使用优化过的pandas数据访问方法：.at，.iat，.loc，.iloc和.ix

## 选取

选择某一列数据，它会返回一个**Series**，等同于**df.A**：

In [16]:
df['A']

2013-01-01   -0.124427
2013-01-02   -0.203842
2013-01-03    1.419414
2013-01-04    0.462395
2013-01-05   -0.198813
2013-01-06   -1.738391
Freq: D, Name: A, dtype: float64

通过使用**[ ]**进行切片选取：

In [17]:
df[0:3]

                   A         B         C         D
2013-01-01 -0.124427  0.057230  0.595329  0.511044
2013-01-02 -0.203842 -1.057279  1.645415  0.717681
2013-01-03  1.419414  0.410206  1.663222  0.070485

In [18]:
df['20130102':'20130104']

                   A         B         C         D
2013-01-02 -0.203842 -1.057279  1.645415  0.717681
2013-01-03  1.419414  0.410206  1.663222  0.070485
2013-01-04  0.462395 -0.232730  0.319583 -0.576445

## 通过标签选取

通过标签进行交叉选取：

In [19]:
df.loc[dates[0]]

A   -0.124427
B    0.057230
C    0.595329
D    0.511044
Name: 2013-01-01 00:00:00, dtype: float64

使用标签对多个轴进行选取

In [20]:
df.loc[:,['A','B']]

                   A         B
2013-01-01 -0.124427  0.057230
2013-01-02 -0.203842 -1.057279
2013-01-03  1.419414  0.410206
2013-01-04  0.462395 -0.232730
2013-01-05 -0.198813  0.767778
2013-01-06 -1.738391  0.049092

In [21]:
df.loc[:,['A','B']][:3]

                   A         B
2013-01-01 -0.124427  0.057230
2013-01-02 -0.203842 -1.057279
2013-01-03  1.419414  0.410206

进行标签切片，包含两个端点

In [22]:
df.loc['20130102':'20130104',['A','B']]

                   A         B
2013-01-02 -0.203842 -1.057279
2013-01-03  1.419414  0.410206
2013-01-04  0.462395 -0.232730

对于返回的对象进行降维处理

In [23]:
df.loc['20130102',['A','B']]

A   -0.203842
B   -1.057279
Name: 2013-01-02 00:00:00, dtype: float64

获取一个标量

In [24]:
df.loc[dates[0],'A']

np.float64(-0.12442695763993035)

快速获取标量（与上面的方法等价）

In [25]:
df.at[dates[0],'A']

np.float64(-0.12442695763993035)

## 通过位置选取

通过传递整型的位置进行选取

In [26]:
df.iloc[3]

A    0.462395
B   -0.232730
C    0.319583
D   -0.576445
Name: 2013-01-04 00:00:00, dtype: float64

通过整型的位置切片进行选取，与python/numpy形式相同

In [27]:
df.iloc[3:5,0:2]

                   A         B
2013-01-04  0.462395 -0.232730
2013-01-05 -0.198813  0.767778

只对行进行切片

In [28]:
df.iloc[1:3,:]

                   A         B         C         D
2013-01-02 -0.203842 -1.057279  1.645415  0.717681
2013-01-03  1.419414  0.410206  1.663222  0.070485

只对列进行切片

In [29]:
df.iloc[:,1:3]

                   B         C
2013-01-01  0.057230  0.595329
2013-01-02 -1.057279  1.645415
2013-01-03  0.410206  1.663222
2013-01-04 -0.232730  0.319583
2013-01-05  0.767778  0.736342
2013-01-06  0.049092  1.319079

只获取某个值

In [30]:
df.iloc[1,1]

np.float64(-1.0572794103933523)

快速获取某个值（与上面的方法等价）

In [31]:
df.iat[1,1]

np.float64(-1.0572794103933523)

## 布尔索引

用某列的值来选取数据

In [32]:
df[df.A > 0]

                   A         B         C         D
2013-01-03  1.419414  0.410206  1.663222  0.070485
2013-01-04  0.462395 -0.232730  0.319583 -0.576445

用**where**操作来选取数据

In [33]:
df[df > 0]

                   A         B         C         D
2013-01-01       NaN  0.057230  0.595329  0.511044
2013-01-02       NaN       NaN  1.645415  0.717681
2013-01-03  1.419414  0.410206  1.663222  0.070485
2013-01-04  0.462395       NaN  0.319583       NaN
2013-01-05       NaN  0.767778  0.736342  1.266193
2013-01-06       NaN  0.049092  1.319079       NaN

用**isin()**方法来过滤数据

In [34]:
df2 = df.copy()

In [35]:
df2['E'] = ['one', 'one', 'two', 'three', 'four', 'three']
df2

                   A         B         C         D      E
2013-01-01 -0.124427  0.057230  0.595329  0.511044    one
2013-01-02 -0.203842 -1.057279  1.645415  0.717681    one
2013-01-03  1.419414  0.410206  1.663222  0.070485    two
2013-01-04  0.462395 -0.232730  0.319583 -0.576445  three
2013-01-05 -0.198813  0.767778  0.736342  1.266193   four
2013-01-06 -1.738391  0.049092  1.319079 -0.403803  three

In [36]:
df2[df2['E'].isin(['two', 'four'])]

                   A         B         C         D     E
2013-01-03  1.419414  0.410206  1.663222  0.070485   two
2013-01-05 -0.198813  0.767778  0.736342  1.266193  four

## 赋值

赋值一个新的列，通过索引来自动对齐数据

In [37]:
s1 = pd.Series([1,2,3,4,5,6], index=pd.date_range('20130102',periods=6))
s1

2013-01-02    1
2013-01-03    2
2013-01-04    3
2013-01-05    4
2013-01-06    5
2013-01-07    6
Freq: D, dtype: int64

In [38]:
df['F'] = s1
df

                   A         B         C         D    F
2013-01-01 -0.124427  0.057230  0.595329  0.511044  NaN
2013-01-02 -0.203842 -1.057279  1.645415  0.717681  1.0
2013-01-03  1.419414  0.410206  1.663222  0.070485  2.0
2013-01-04  0.462395 -0.232730  0.319583 -0.576445  3.0
2013-01-05 -0.198813  0.767778  0.736342  1.266193  4.0
2013-01-06 -1.738391  0.049092  1.319079 -0.403803  5.0

通过标签赋值

In [39]:
df.at[dates[0], 'A'] = 0
df

                   A         B         C         D    F
2013-01-01  0.000000  0.057230  0.595329  0.511044  NaN
2013-01-02 -0.203842 -1.057279  1.645415  0.717681  1.0
2013-01-03  1.419414  0.410206  1.663222  0.070485  2.0
2013-01-04  0.462395 -0.232730  0.319583 -0.576445  3.0
2013-01-05 -0.198813  0.767778  0.736342  1.266193  4.0
2013-01-06 -1.738391  0.049092  1.319079 -0.403803  5.0

通过位置赋值

In [40]:
df.iat[0,1] = 0
df

                   A         B         C         D    F
2013-01-01  0.000000  0.000000  0.595329  0.511044  NaN
2013-01-02 -0.203842 -1.057279  1.645415  0.717681  1.0
2013-01-03  1.419414  0.410206  1.663222  0.070485  2.0
2013-01-04  0.462395 -0.232730  0.319583 -0.576445  3.0
2013-01-05 -0.198813  0.767778  0.736342  1.266193  4.0
2013-01-06 -1.738391  0.049092  1.319079 -0.403803  5.0

通过传递numpy array赋值

In [41]:
df.loc[:,'D'] = np.array([5] * len(df))
df

                   A         B         C    D    F
2013-01-01  0.000000  0.000000  0.595329  5.0  NaN
2013-01-02 -0.203842 -1.057279  1.645415  5.0  1.0
2013-01-03  1.419414  0.410206  1.663222  5.0  2.0
2013-01-04  0.462395 -0.232730  0.319583  5.0  3.0
2013-01-05 -0.198813  0.767778  0.736342  5.0  4.0
2013-01-06 -1.738391  0.049092  1.319079  5.0  5.0

通过**where**操作来赋值

In [42]:
df2 = df.copy()
df2[df2 > 0] = -df2
df2

                   A         B         C    D    F
2013-01-01  0.000000  0.000000 -0.595329 -5.0  NaN
2013-01-02 -0.203842 -1.057279 -1.645415 -5.0 -1.0
2013-01-03 -1.419414 -0.410206 -1.663222 -5.0 -2.0
2013-01-04 -0.462395 -0.232730 -0.319583 -5.0 -3.0
2013-01-05 -0.198813 -0.767778 -0.736342 -5.0 -4.0
2013-01-06 -1.738391 -0.049092 -1.319079 -5.0 -5.0

# 缺失值处理

在pandas中，用**np.nan**来代表缺失值，这些值默认不会参与运算。

reindex()允许你修改、增加、删除指定轴上的索引，并返回一个数据副本。

In [43]:
df1 = df.reindex(index=dates[0:4], columns=list(df.columns)+['E'])
df1.loc[dates[0]:dates[1],'E'] = 1
df1

                   A         B         C    D    F    E
2013-01-01  0.000000  0.000000  0.595329  5.0  NaN  1.0
2013-01-02 -0.203842 -1.057279  1.645415  5.0  1.0  1.0
2013-01-03  1.419414  0.410206  1.663222  5.0  2.0  NaN
2013-01-04  0.462395 -0.232730  0.319583  5.0  3.0  NaN

剔除所有包含缺失值的行数据

In [44]:
df1.dropna(how='any')

                   A         B         C    D    F    E
2013-01-02 -0.203842 -1.057279  1.645415  5.0  1.0  1.0

填充缺失值

In [45]:
df1.fillna(value=5)

                   A         B         C    D    F    E
2013-01-01  0.000000  0.000000  0.595329  5.0  5.0  1.0
2013-01-02 -0.203842 -1.057279  1.645415  5.0  1.0  1.0
2013-01-03  1.419414  0.410206  1.663222  5.0  2.0  5.0
2013-01-04  0.462395 -0.232730  0.319583  5.0  3.0  5.0

获取值是否为**nan**的布尔标记

In [46]:
pd.isnull(df1)

                A      B      C      D      F      E
2013-01-01  False  False  False  False   True  False
2013-01-02  False  False  False  False  False  False
2013-01-03  False  False  False  False  False   True
2013-01-04  False  False  False  False  False   True

# 运算

## 统计

运算过程中，通常不包含缺失值。

进行描述性统计

In [47]:
df.mean()

A   -0.043206
B   -0.010489
C    1.046495
D    5.000000
F    3.000000
dtype: float64

对其他轴进行同样的运算

In [48]:
df.mean(1)

2013-01-01    1.398832
2013-01-02    1.276859
2013-01-03    2.098569
2013-01-04    1.709850
2013-01-05    2.061061
2013-01-06    1.925956
Freq: D, dtype: float64

对于拥有不同维度的对象进行运算时需要对齐。除此之外，pandas会自动沿着指定维度计算。

In [49]:
s = pd.Series([1,3,5,np.nan,6,8], index=dates).shift(2)
s

2013-01-01    NaN
2013-01-02    NaN
2013-01-03    1.0
2013-01-04    3.0
2013-01-05    5.0
2013-01-06    NaN
Freq: D, dtype: float64

In [50]:
df.sub(s, axis='index')

                   A         B         C    D    F
2013-01-01       NaN       NaN       NaN  NaN  NaN
2013-01-02       NaN       NaN       NaN  NaN  NaN
2013-01-03  0.419414 -0.589794  0.663222  4.0  1.0
2013-01-04 -2.537605 -3.232730 -2.680417  2.0  0.0
2013-01-05 -5.198813 -4.232222 -4.263658  0.0 -1.0
2013-01-06       NaN       NaN       NaN  NaN  NaN

## Apply 函数作用

通过apply()对函数作用

In [51]:
df.apply(np.cumsum)

                   A         B         C     D     F
2013-01-01  0.000000  0.000000  0.595329   5.0   NaN
2013-01-02 -0.203842 -1.057279  2.240744  10.0   1.0
2013-01-03  1.215572 -0.647073  3.903966  15.0   3.0
2013-01-04  1.677967 -0.879803  4.223549  20.0   6.0
2013-01-05  1.479154 -0.112025  4.959891  25.0  10.0
2013-01-06 -0.259237 -0.062932  6.278970  30.0  15.0

In [52]:
df.apply(lambda x:x.max()-x.min())

A    3.157805
B    1.825058
C    1.343640
D    0.000000
F    4.000000
dtype: float64

## 频数统计

In [53]:
s = pd.Series(np.random.randint(0, 7, size=10))
s

0    1
1    4
2    4
3    4
4    4
5    1
6    2
7    2
8    4
9    5
dtype: int64

In [54]:
s.value_counts()

4    5
1    2
2    2
5    1
Name: count, dtype: int64

## 字符串方法

对于Series对象，在其str属性中有着一系列的字符串处理方法。就如同下段代码一样，能很方便的对array中各个元素进行运算。值得注意的是，在str属性中的模式匹配默认使用正则表达式。

In [55]:
s = pd.Series(['A', 'B', 'C', 'Aaba', 'Baca', np.nan, 'CABA', 'dog', 'cat'])
s.str.lower()

0       a
1       b
2       c
3    aaba
4    baca
5     NaN
6    caba
7     dog
8     cat
dtype: object

# 合并

## Concat 连接

pandas中提供了大量的方法能够轻松对Series，DataFrame和Panel对象进行不同满足逻辑关系的合并操作

通过**concat()**来连接pandas对象

In [56]:
df = pd.DataFrame(np.random.randn(10,4))
df

          0         1         2         3
0 -1.296015 -0.318947  0.470567  0.414543
1  2.155432 -0.889273 -1.231756  0.703415
2 -0.234350 -0.602609 -1.743226 -0.142924
3 -0.155255 -0.214395  0.080422 -0.748452
4 -0.198460  1.178806 -0.151469  1.862209
5 -1.950234  1.760377 -0.184396 -0.033635
6 -1.164947 -1.991039 -1.239818 -0.569099
7  1.730783  1.500902 -0.101298  0.174018
8 -0.198691  0.218409  0.186491 -0.559932
9  0.425286 -2.415594 -1.839211 -1.389267

In [57]:
#break it into pieces
pieces = [df[:3], df[3:7], df[7:]]
pieces

[          0         1         2         3
 0 -1.296015 -0.318947  0.470567  0.414543
 1  2.155432 -0.889273 -1.231756  0.703415
 2 -0.234350 -0.602609 -1.743226 -0.142924,
           0         1         2         3
 3 -0.155255 -0.214395  0.080422 -0.748452
 4 -0.198460  1.178806 -0.151469  1.862209
 5 -1.950234  1.760377 -0.184396 -0.033635
 6 -1.164947 -1.991039 -1.239818 -0.569099,
           0         1         2         3
 7  1.730783  1.500902 -0.101298  0.174018
 8 -0.198691  0.218409  0.186491 -0.559932
 9  0.425286 -2.415594 -1.839211 -1.389267]

In [58]:
pd.concat(pieces)

          0         1         2         3
0 -1.296015 -0.318947  0.470567  0.414543
1  2.155432 -0.889273 -1.231756  0.703415
2 -0.234350 -0.602609 -1.743226 -0.142924
3 -0.155255 -0.214395  0.080422 -0.748452
4 -0.198460  1.178806 -0.151469  1.862209
5 -1.950234  1.760377 -0.184396 -0.033635
6 -1.164947 -1.991039 -1.239818 -0.569099
7  1.730783  1.500902 -0.101298  0.174018
8 -0.198691  0.218409  0.186491 -0.559932
9  0.425286 -2.415594 -1.839211 -1.389267

## Join 合并

类似于SQL中的合并(merge)

In [59]:
left = pd.DataFrame({'key':['foo', 'foo'], 'lval':[1,2]})
left

   key  lval
0  foo     1
1  foo     2

In [60]:
right = pd.DataFrame({'key':['foo', 'foo'], 'lval':[4,5]})
right

   key  lval
0  foo     4
1  foo     5

In [61]:
pd.merge(left, right, on='key')

   key  lval_x  lval_y
0  foo       1       4
1  foo       1       5
2  foo       2       4
3  foo       2       5

## Append 添加

将若干行添加到dataFrame后面

In [62]:
df = pd.DataFrame(np.random.randn(8, 4), columns=['A', 'B', 'C', 'D'])
df

          A         B         C         D
0  0.839299  0.420973 -1.218764 -1.282566
1 -1.007636  0.814227  1.210117  0.303333
2  2.000872 -0.327250  0.683617 -0.572198
3  2.404160 -0.843688  0.010588  1.240824
4 -0.479282 -0.804120  0.244819 -0.688671
5 -0.885304 -0.834233 -0.330042  0.646032
6  0.523224  2.711412 -0.591691 -1.191953
7 -0.698415 -0.741457  0.209821  0.752146

In [63]:
s = df.iloc[3]
s

A    2.404160
B   -0.843688
C    0.010588
D    1.240824
Name: 3, dtype: float64

In [64]:
df.append(s, ignore_index=True)

AttributeError: 'DataFrame' object has no attribute 'append'

# 分组

对于“group by”操作，我们通常是指以下一个或几个步骤：
* **划分** 按照某些标准将数据分为不同的组
* **应用** 对每组数据分别执行一个函数
* **组合** 将结果组合到一个数据结构

In [ ]:
df = pd.DataFrame({'A' : ['foo', 'bar', 'foo', 'bar', 
                          'foo', 'bar', 'foo', 'bar'],
                   'B' : ['one', 'one', 'two', 'three', 
                          'two', 'two', 'one', 'three'],
                   'C' : np.random.randn(8),
                   'D' : np.random.randn(8)})
df

分组并对每个分组应用sum函数

In [ ]:
df.groupby('A').sum()

按多个列分组形成层级索引，然后应用函数

In [ ]:
df.groupby(['A','B']).sum()

# 变形

## 堆叠

In [ ]:
tuples = list(zip(*[['bar', 'bar', 'baz', 'baz',
                     'foo', 'foo', 'qux', 'qux'],
                    ['one', 'two', 'one', 'two',
                     'one', 'two', 'one', 'two']]))

In [ ]:
index = pd.MultiIndex.from_tuples(tuples, names=['first', 'second'])

In [ ]:
df = pd.DataFrame(np.random.randn(8, 2), index=index, columns=['A', 'B'])

In [ ]:
df2 = df[:4]
df2

**stack()**方法对DataFrame的列“压缩”一个层级

In [ ]:
stacked = df2.stack()
stacked

对于一个“堆叠过的”DataFrame或者Series（拥有MultiIndex作为索引），**stack()**的逆操作是**unstack()**，默认反堆叠到上一个层级

In [ ]:
stacked.unstack()

In [ ]:
stacked.unstack(1)

In [ ]:
stacked.unstack(0)

## 数据透视表

In [ ]:
df = pd.DataFrame({'A' : ['one', 'one', 'two', 'three'] * 3,
                   'B' : ['A', 'B', 'C'] * 4,
                   'C' : ['foo', 'foo', 'foo', 'bar', 'bar', 'bar'] * 2,
                   'D' : np.random.randn(12),
                   'E' : np.random.randn(12)})
df

 我们可以轻松地从这个数据得到透视表

In [ ]:
pd.pivot_table(df, values='D', index=['A', 'B'], columns=['C'])

# 时间序列

pandas在对频率转换进行重新采样时拥有着简单，强大而且高效的功能（例如把按秒采样的数据转换为按5分钟采样的数据）。这在金融领域很常见，但又不限于此。

In [ ]:
rng = pd.date_range('1/1/2012', periods=100, freq='S')
rng

In [ ]:
ts = pd.Series(np.random.randint(0,500,len(rng)), index=rng)
ts

In [ ]:
ts.resample('5Min', how='sum')

时区表示

In [ ]:
rng = pd.date_range('3/6/2012', periods=5, freq='D')
rng

In [ ]:
ts = pd.Series(np.random.randn(len(rng)), index=rng)
ts

In [ ]:
ts_utc = ts.tz_localize('UTC')
ts_utc

时区转换

In [ ]:
ts_utc.tz_convert('US/Eastern')

时间跨度转换

In [ ]:
rng = pd.date_range('1/1/2012', periods=5, freq='M')
rng

In [ ]:
ts = pd.Series(np.random.randn(len(rng)), index=rng)
ts

In [ ]:
ps = ts.to_period()
ps

In [ ]:
ps.to_timestamp()

日期与时间戳之间的转换使得可以使用一些方便的算术函数。例如，我们把以11月为年底的季度数据转换为当前季度末月底为始的数据

In [ ]:
prng = pd.period_range('1990Q1', '2000Q4', freq='Q-NOV')
prng

In [ ]:
ts = pd.Series(np.random.randn(len(prng)), index = prng)
ts

In [ ]:
ts.index = (prng.asfreq('M', 'end') ) .asfreq('H', 'start') +9
ts

# 分类

从版本0.15开始，pandas在**DataFrame**中开始包括分类数据。

In [ ]:
df = pd.DataFrame({"id":[1,2,3,4,5,6], "raw_grade":['a', 'b', 'b', 'a', 'e', 'e']})
df

把raw_grade转换为分类类型

In [ ]:
df["grade"] = df["raw_grade"].astype("category")
df["grade"]

重命名类别名为更有意义的名称

In [ ]:
df["grade"].cat.categories = ["very good", "good", "very bad"]

对分类重新排序，并添加缺失的分类

In [ ]:
df["grade"] = df["grade"].cat.set_categories(["very bad", "bad", "medium", "good", "very good"])
df["grade"]

排序是按照分类的顺序进行的，而不是字典序

In [ ]:
df.sort_values(by="grade")

按分类分组时，也会显示空的分类

In [ ]:
df.groupby("grade").size()

# 绘图

In [ ]:
ts = pd.Series(np.random.randn(1000), index=pd.date_range('1/1/2000', periods=1000))
ts = ts.cumsum()
ts.plot()

对于DataFrame类型，**plot()**能很方便地画出所有列及其标签

In [ ]:
df = pd.DataFrame(np.random.randn(1000, 4), index=ts.index, columns=['A', 'B', 'C', 'D'])
df = df.cumsum()
plt.figure(); df.plot(); plt.legend(loc='best')

# 获取数据的I/O

## CSV

写入一个csv文件

In [ ]:
df.to_csv('data/foo.csv')

从一个csv文件读入

In [ ]:
pd.read_csv('data/foo.csv')

## HDF5

HDFStores的读写

写入一个HDF5 Store

In [ ]:
df.to_hdf('data/foo.h5', 'df')

从一个HDF5 Store读入

In [ ]:
pd.read_hdf('data/foo.h5', 'df')

## Excel

MS Excel的读写

写入一个Excel文件

In [ ]:
df.to_excel('data/foo.xlsx', sheet_name='Sheet1')

从一个excel文件读入

In [ ]:
pd.read_excel('data/foo.xlsx', 'Sheet1', index_col=None, na_values=['NA'])